Revit 2017 API
StructuralSectionRectangular.PrincipalAxesAngle Property
 Rotation angle between the principal axes and cross section reference planes.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public double PrincipalAxesAngle { get; set; }
Visual Basic
Public Property PrincipalAxesAngle As Double
	Get
	Set
Visual C++
public:
property double PrincipalAxesAngle {
	double get ();
	void set (double value);
}
See Also
StructuralSectionRectangular Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace